import pandas as pd
import pytest


@pytest.fixture
def test_period():
    """Фикстура с тестовым периодом дат"""
    return ["01.01.2023 00:00:00", "31.01.2023 23:59:59"]


@pytest.fixture
def mock_currency_data():
    """Фикстура с мок-данными для теста валют"""
    return '{"user_currencies": ["USD", "EUR"]}'


@pytest.fixture
def mock_stock_data():
    """Фикстура с мок-данными для теста акций"""
    return '{"user_stocks": ["AAPL"]}'


@pytest.fixture
def test_df():
    """Фикстура с тестовыми данными DataFrame"""
    return pd.DataFrame(
        {
            "Дата операции": ["01.01.2023 12:00:00", "15.01.2023 12:00:00"],
            "Номер карты": ["1234****5678", "8765****4321"],
            "Сумма операции": [-100, 200],
            "Кэшбэк": [1, 0],
            "Сумма операции с округлением": [-100, 200],
            "Категория": ["Магазин", "Ресторан"],
            "Описание": ["Покупка +79123456789", "Обед"],
            "Дата платежа": ["02.01.2023", "16.01.2023"],
            "Статус": ["OK", "OK"],
            "Валюта операции": ["RUB", "RUB"],
            "Валюта платежа": ["RUB", "RUB"],
            "Сумма платежа": [-100, 200],  # Добавляем недостающую колонку
        }
    )


@pytest.fixture
def mock_phone_data():
    return [
        {
            "Дата операции": "01.01.2023 12:00:00",
            "Описание": "Покупка +79123456789",
            # остальные поля...
        }
    ]


@pytest.fixture
def test_spending_df():
    data = {
        "Дата операции": ["31.12.2021 16:44:00", "15.01.2022 12:00:00"],
        "Категория": ["Супермаркеты", "Рестораны"],
        "Сумма операции": [1000, 2000],
        "Описание": ["Покупки в магазине", "Обед в кафе"],
    }
    return pd.DataFrame(data)
